{"inkVersion":21,"root":[["^It’s the first day of summer holiday. It doesn’t mean much to you yet since you’re only starting pre-school next year, but you do know that summer holiday means that all the kids from the neighborhood will be able to play all day, every day. It’s hard to not be excited about that.","\n","^It’s not even 10AM when the doorbell already rings. The other kids, just as excited about all the possibilities as you are, are coming to ask you to play. You and your older sibling head out together, and only 15 minutes later there are around 10 kids passionately arguing about what to play.","\n","ev","str","^Continue","/str","/ev",{"*":"0.c-0","flg":4},{"c-0":["^ ",{"->":"prol1"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"prol1":[["^Eventually everyone settles for hide-and-seek. You are among the first ones to hide, running straight to the yard of one of the other kids, looking for the best place to hide.","\n","^You see a small playhouse you could hide in, a large rock to crouch behind, a wheelbarrow just standing upright, and a tarp on the ground you could crawl under.","\n","ev","str","^Hide in the playhouse","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Hide behind the rock","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Hide in the wheelbarrow","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Hide under the tarp","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":"playhouse"},"\n",{"#f":5}],"c-1":["^ ",{"->":"rock"},"\n",{"#f":5}],"c-2":["^ ",{"->":"wheelbarrow"},"\n",{"#f":5}],"c-3":["^ ",{"->":"tarp"},"\n",{"#f":5}]}],{"#f":1}],"playhouse":[["^You run into the playhouse, closing the door behind you. You look where exactly to hide - the windows will immediately reveal you if you just stand around.","\n","^There is a small table, and you crawl underneath it, knowing that it will block you from the view perfectly. You sit under the table, an excited smile on your face. You’re pretty sure you have found the best spot to hide in.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"playhouse1"},"\n",{"#f":5}]}],{"#f":1}],"playhouse1":[["^Minutes pass. You eventually hear footsteps outside the playhouse, approaching it carefully. They come closer and closer, stopping by the window. You can only assume that someone is peering in, trying to see if anyone is hiding inside. You don’t dare to move a muscle.","\n","^The footsteps start again, but this time they’re moving away from the playhouse. You relax, and the smile on your face just spreads wider. You were right, this is a good place to hide.","\n","^More time passes. Every now and then you can hear someone running or walking nearby, but you remain hidden. It’s honestly starting to get a little bit boring at this point, but you want to win, and so, you remain hidden.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"playhouse2"},"\n",{"#f":5}]}],{"#f":1}],"playhouse2":[["^More footsteps appear, but this time they’re determinedly approaching the playhouse. You freeze, not sure if you want to be found at this point or not. But before you have time to decide, the door of the playhouse flies open, revealing your older sibling in the doorway, immediately locking eyes with you. A grin slowly appears on their face.","\n","^“I told you she would be here!” they call out to someone behind them as you start crawling from underneath the table.","\n","^“Wait, really?” the kid who was the seeker first says, visibly confused. “I swear I checked the playhouse, first thing!”","\n","^“I was hiding under the table!” you exclaim, proudly revealing your hiding spot. The seeker groans a bit in frustration.","\n","^“Should have checked looked from the doorway,” they mumble. “But fine! You win this round!”","\n","^You briefly celebrate your victory, but you know that the game isn’t over yet - it’s now your time to seek.","\n",["ev",{"^->":"playhouse2.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^The game continues ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"playhouse2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],{"->":"gamecontinue"},"\n",{"#f":5}]}],{"#f":1}],"rock":[["^You run behind the rock and lean your back on it, heart pounding from excitement. You feel pretty confident in your spot - the rock is big enough that you can easily move around it while trying to avoid being seen.","\n","^You wait for a while, and soon hear footsteps walking around, signaling that the seeker had entered the yard. You remain completely still, hardly even daring to breathe as you try to listen where the footsteps are coming from.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"rock2"},"\n",{"#f":5}]}],{"#f":1}],"rock2":["^Suddenly you hear them on your right, and as silently as you possibly can, start moving to the left, trying to avoid being seen by the seeker. The footsteps keep following you, faster and faster, and you throw caution to the wind, starting to run around the rock yourself. The seeker is now chasing you, and you feverishly try to figure out a way to escape them, but just then the seeker changes their direction, and in no time, you find yourself face-to-face with the seeker, almost crashing into them.","\n","^“A-ha!” the seeker exclaims, victorious. “Found you!”","\n","^You stop, defeated.","\n","^“But I wasn’t the first, right?” you ask, feeling a little bit hopeful.","\n","^“No but you were like, the third person,” the seeker reveals. “C’mon, we need to find the others.","\n","^You sigh, and join the seekers, looking for the rest of the kids.","\n","^The game continues. ",{"->":"gamecontinue"},"\n",{"#f":1}],"wheelbarrow":[["^You spot an empty wheelbarrow just sitting in the middle of the yard. It’s upright, just there, but you decide to climb into it, trying to curl into the smallest ball possible. And then, you wait.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"wheelbarrow2"},"\n",{"#f":5}]}],{"#f":1}],"wheelbarrow2":["^It doesn’t take that long until you can already hear footsteps approaching the yard, but then they suddenly stop, not too far away. Your heart is pounding, as you hope that the seeker would just go away.","\n","^“MC,” the seeker says, sounding somewhat confused. “I can see you all the way from here.”","\n","^You slowly raise your head and look towards the seeker, feeling a bit embarrassed. You have no idea what you were thinking, of course you’d be easily spotted from the wheelbarrow.","\n","^“I… I uhm…” you try to come up with something to defend yourself with, but the words refuse to come out. And so you just climb out of the wheelbarrow, and start looking for other players, knowing for a fact that you were the first one to be found.","\n","^The game continues. ",{"->":"gamecontinue"},"\n",{"#f":1}],"tarp":[["^After a moment’s consideration you run to the tarp on the ground. You lift it up, peeking inside to check that there is nothing gross underneath it, but apart from a few dozen bugs, it seems to be fine. You hesitate for a moment longer, but decide to crawl under the tarp anyway, curling up into a small ball, trying your best to pretend to be nothing but a pile of dirt under the tarp.","\n","^Time passes slowly. It’s getting increasingly hotter underneath the tarp, direct sunlight mercilessly shining straight to it. But you are resilient, staying unmoving underneath the tarp.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"tarp2"},"\n",{"#f":5}]}],{"#f":1}],"tarp2":[["^Finally, you hear tentative footsteps walking around the yard - the seeker is here. You remain completely still and wait. The footsteps stop for a moment, but then they keep walking, right past the tarp, further and further away.","\n","^When the yard is quiet again you dare to lift the edge of the tarp a bit, desperate for some cooler air. You crawl closer to the edge, peeking your head out, the warm summer air suddenly feeling like a cool winter breeze.","\n","^You stay like that for a long while, getting the fresh air you so desperately need. You only dive back underneath the tarp when you hear footsteps approaching the yard again, but immediately miss the ability to breathe in general.","\n","^You hear the footsteps walk past you again, and for a while you feel victorious. You are still in the game, even though the warmth underneath the tarp is nearly unbearable at this point. But you remain still underneath the tarp, just suffering through the heat.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"tarp3"},"\n",{"#f":5}]}],{"#f":1}],"tarp3":["^Eventually you can’t take it anymore, and even though you can still hear someone walking around in the yard, you crawl from underneath the tarp, covered in sweat.","\n","^“I give up!” you exclaim the second you’re back on your feet.","\n","^The seeker turns to look at you, clearly surprised to see you.","\n","^“MC! Where were you?” they ask. You point your finger to the tarp.","\n","^“Under there.”","\n","^“You were there this whole time?” the seeker asks, looking even more surprised. “You kind of look like you’re going to collapse.”","\n","^You kind of feel like it too. The legs underneath you feel wobbly. Maybe it wasn’t a good idea to hide underneath the tarp. But you push your woozy feeling aside.","\n","^“I wasn’t the first one to be found, right?” you question instead, and the seeker shakes their head.","\n","^“You almost won actually. But there are still a few people missing.” The seeker looks at you for a moment longer. “I think you should take a break, though. Sit down and get something to drink.”","\n","^It doesn’t sound half-bad. You go home to grab some water, and sit on the porch while drinking it, soon feeling completely renewed, and join the game again for the next round.","\n","^The game continues. ",{"->":"gamecontinue"},"\n",{"#f":1}],"gamecontinue":["^You and all the other kids play a few more rounds of hide-and-seek. Your sibling absolutely dominates the game, finding masterful hiding spots that are always among the last ones to be found. You don’t remember the last time you’ve had this much fun playing with the others.","\n","^Eventually the kids start getting called back inside for dinners, and eventually your dad calls you and your sibling inside too. You have a stereotypical dinner. Life is good.","\n","^After eating, you go to the living room, plopping yourself down on the floor in front of the tv.","\n",{"->":"watchtv"},{"#f":1}],"watchtv":[["^This is one of your favorite cartoons, one of your favorite episodes, even. It’s just about to get to the best part when the channel suddenly changes.","\n","^“Hey!” you exclaim, and turn around to see your sibling sitting on the couch with a wide grin on their face, the remote of the tv in their hand.","\n","^\"Mom says it's my turn now,\" they say, settling better on the couch. \"Besides, you have seen this episode like, a million times. Do you really want to see another rerun?\"","\n","ev","str","^Protest","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask to join","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"protest"},"\n",{"#f":5}],"c-1":["^ ",{"->":"join"},"\n",{"#f":5}]}],{"#f":1}],"protest":[["^“But it’s my favorite!” you insist. “I wanna watch it! Besides, you’re only watching this because John likes it, and you have a crush on him!”","\n","^You masterfully avoid the pillow that is thrown your way. The expression on your sibling’s face has turned into a deep frown.","\n","^“I do not!” they claim, but you know better based on what was written in your sibling’s diary. “Just… shut up or I’ll go tell mom that… that you did something bad!”","\n","^Your heart drops in fear at the threat, and you don’t have any other choice but to admit your defeat. You poke your tongue out at your sibling as a final sign of defiance before getting up from the floor and heading upstairs to your room.","\n",["ev",{"^->":"protest.0.8.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^2D gameplay ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"protest.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.8.s"},[{"#n":"$r2"}],{"->":"tutorial"},"\n",{"#f":5}]}],{"#f":1}],"join":[["^You glance back towards the tv. The show that’s on the screen right now actually looks… sort of interesting.","\n","^“Can I… watch with you?” you ask tentatively. You look back at your sibling, who looks surprised by the question, but soon starts smiling at you.","\n","^“Sure,” they say, moving a bit on the couch to make more space for you. You hop on the couch. They start explaining to you what the show is about, something about human looking aliens traveling time and space, but honestly it goes badly over your head.","\n","^But the show is still good. Maybe you should watch it with your sibling more often.","\n","ev","str","^2D gameplay","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"tutorial"},"\n",{"#f":5}]}],{"#f":1}],"tutorial":[["^Flashlight tutorial","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"prologue_cont"},"\n",{"#f":5}]}],{"#f":1}],"prologue_cont":[["^You enter your bedroom and crawl to bed, still clutching the flashlight in your hands. You lay on your back, watching the long shadows on the ceiling. Usually they look like long legs of a monster, but tonight, they are just shadows. They’re nothing to worry about.","\n","^You fall into peaceful sleep, looking forward to the best summer vacation ever.","\n","^The days fly by. Every day of the summer is filled with fun and excitement, and it feels like it will never end. You wish it will never end.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"prol_cont2"},"\n",{"#f":5}]}],{"#f":1}],"prol_cont2":["^The kids from the neighborhood are all gathered again to play hide-and-seek. It’s almost a weekly tradition at this point, just a massive game that everyone participates in. It’s something you look forward to every week, although your sibling remains the reigning champion.","\n","^The final round of the day starts. You are the seeker this time, dutifully counting all the way to 50 so that the kids have time to run around and hide.","\n","^“47… 48… 49… 50!” you yell out. “Ready or not, here I come!”","\n","^You start looking for the kids, finding them one by one, collecting your army of seekers. Unsurprisingly, one kid seems to be harder to find again - your sibling. After checking every yard, every possible hiding spot, they’re still nowhere to be found. ",{"->":"But_your_sibling_has_to_be_somewhere_right"},"\n",{"#f":1}],"But_your_sibling_has_to_be_somewhere_right":[["^But your sibling has to be somewhere, right?","\n","ev","str","^Search the playhouse","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Search the toolshed","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Search the compost","/str","/ev",{"*":".^.c-2","flg":20},{"*":".^.c-3","flg":24},{"c-0":["^ ",{"->":"playhouselook"},"\n",{"#f":5}],"c-1":["^ ",{"->":"toolshed"},"\n",{"#f":5}],"c-2":["^ ",{"->":"compost"},"\n",{"#f":5}],"c-3":[{"->":"keeplooking"},"\n",{"#f":5}]}],{"#f":1}],"playhouselook":["ev",{"CNT?":"playhouse"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Ever since you hid within the playhouse, it’s become one of the first places anyone checks as a seeker, you included. But perhaps your sibling simply moved there at some point? It is worth a look. You open the door of the playhouse, expecting to see your sibling under the table, grinning and laughing because they managed to hide for so long. But no such luck. The playhouse is empty and lifeless. You close the door, disappointed.","\n",{"->":".^.^.^.4"},null]}],"nop","\n","ev",{"CNT?":"playhouse"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Your eyes land on the playhouse in your neighbor’s yard. You’re pretty sure that someone must have checked it already, but perhaps your sibling simply moved there at some point? It is worth a look. You open the door of the playhouse, expecting to see your sibling under the table, grinning and laughing because they managed to hide for so long. But no such luck. The playhouse is empty and lifeless. You close the door, disappointed.","\n",{"->":".^.^.^.11"},null]}],"nop","\n",{"->":"But_your_sibling_has_to_be_somewhere_right"},{"#f":1}],"toolshed":["^There is a tool shed for gardening tools behind the house, where all the shovels, branch cutters and such are stored when they’re not in use. It used to be a very popular hiding spot, until your parents deemed it too dangerous for kids to hide amidst sharp tools and put a padlock on the door. It’s a long shot, but maybe your sibling got it open somehow?","\n","^You run up to the tool shed and try to open the door. But as usual, it’s locked, the padlock holding on sturdily. Or maybe your sibling got in, but someone put the lock back on, locking them inside? The thought terrifies you.","\n","^“Sibling, are you in there? Say something if you are!” You shout at the door, dreading and hoping for a response from within. No sound comes out. It appears there is no one within the shed.","\n",{"->":"But_your_sibling_has_to_be_somewhere_right"},{"#f":1}],"compost":["^As unlikely as it might be… perhaps your sibling is hiding within the compost? You can’t imagine even they would be so dedicated to a game of hide and seek, but they’ve surprised you before. You go up to the compost and slowly open the lid. The disgusting stench of rotting food and leaves hit you immediately, leaving you gagging. No way could your sibling be there. Still, you have to make sure. You peer into the depths of the compost, seeing flies, ants, beetles and spiders crawling amidst the mass, but not your sibling. You slam the lid shut, gasping for fresh air. You’re feeling lightheaded. You’re glad your sibling wasn’t in there, but their absence is growing more pressing by the minute.","\n",{"->":"But_your_sibling_has_to_be_somewhere_right"},{"#f":1}],"keeplooking":[["^You desperately restart the search, going through every nook and cranny once again. The other kids are searching, too, the older kids even daring to climb up some ladders to check some of the rooftops of the houses. Still, your sibling is nowhere to be found.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search2"},"\n",{"#f":5}]}],{"#f":1}],"search2":[["^The shadows are slowly growing longer, and the searching turns almost desperate. Kids start checking the insides of the houses, too. When you go inside your house, your mother notices the frantic look on your face, and makes you admit in a shaky voice that no one can find your sibling.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search3"},"\n",{"#f":5}]}],{"#f":1}],"search3":[["^Adults join the search, too. But still, no sibling.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search4"},"\n",{"#f":5}]}],{"#f":1}],"search4":[["^The police show up. Your mother is hysterical at this point. You barely manage to talk to the police through your sobs.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search5"},"\n",{"#f":5}]}],{"#f":1}],"search5":[["^They don’t come home that night.","\n","^Or the next one.","\n","^Or the next one.","\n","^You fall asleep holding the flashlight, every night.","\n","ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"3_days"},"\n",{"#f":5}]}],{"#f":1}],"3_days":[["^Your sibling has been missing for 3 days.","\n","ev","str","^Another 2D section","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"2D"},"\n",{"#f":5}]}],{"#f":1}],"2D":["^2D stuff happens","\n",{"->":"5_days"},{"#f":1}],"5_days":[["^Your sibling has been missing for 5 days.","\n","^You went out today to spread the missing person posters with your dad. To the store, to lampposts, to any wall that people pass by. You could’ve done it by yourself, but your parents aren’t letting you leave the house unattended anymore. As you tape to posters, you look at the picture within them. It’s your sibling, smiling on their seventh birthday. The fact that they’re still not home unnerves you. The house is feeling a lot emptier. You clutch the stack of posters more tightly as you continue the task. Someone has seen them. Someone will contact you soon. They must.","\n","ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"12_days"},"\n",{"#f":5}]}],{"#f":1}],"12_days":[["^Your sibling has been missing for 12 days.","\n","^You can hear your parents arguing downstairs. It’s hard to make out, but it’s not the source of the argument is clear: your sibling. Mom is blaming dad for not keeping a closer eye on them, while dad is yelling at mom to stop wallowing in self-pity and help us look. You squeeze your flashlight tighter as their voices grow louder until you hear the front door slam. One of them has left the house. Is it your father, going to cool his head and look for your sibling again? Or is it your mother, going to the store to get more of that drink that makes her act weird? You can’t tell.","\n","ev","str","^...","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"30_days"},"\n",{"#f":5}]}],{"#f":1}],"30_days":["^Your sibling has been missing for 30 days.","\n","^It’s been a full month, but it feels like years have passed. The absence of your sibling burns like an open wound, and your parents aren’t doing much better. No one has cleaned since they went missing, the house starting to stink of garbage and filled with dust.","\n","^But within your dreams you see them again, laughing as they run away to a flower-filled meadow. You try to run after them, to beg them to come back, but you trip and fall flat on your face. You look and see your legs tangled in spider webs, the thick woven masses holding you in place as your sibling disappears from sight, swallowed by a black wall of tiny, writhing legs. You yell as the wall comes closer, intent on claiming you as well. You don’t scream as the wall closes in and thousands of spiders flood your body, covering your eyes, crawling in your nose, filling your mouth with a bitter taste.","\n","end",{"#f":1}],"#f":1}],"listDefs":{}}