{"inkVersion":21,"root":[["^PROLOGUE","\n","^It’s the first day of summer holiday. It doesn’t mean much to you yet since you’re only starting pre-school next year, but you do know that summer holiday means that all the kids from the neighborhood will be able to play all day, every day. It’s hard to not be excited about that.","\n","^It’s not even 10AM when the doorbell already rings. The other kids, just as excited about all the possibilities as you are, are coming to ask you to play. You and your older sibling, Jamie, head out together, and only 15 minutes later there are around 10 kids passionately arguing about what to do.","\n","ev","str","^Continue","/str","/ev",{"*":"0.c-0","flg":4},{"c-0":["^ ",{"->":"prol1"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"prol1":[["^Eventually everyone settles for hide-and-seek. You are among the first ones to hide, running straight to the backyard of one of the other kids, looking for the best place to hide.","\n","^You see a small playhouse you could hide in, a large rock to crouch behind, a wheelbarrow, and a tarp on the ground you could crawl under.","\n","ev","str","^Hide in the playhouse","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Hide behind the rock","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Hide in the wheelbarrow","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Hide under the tarp","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":"playhouse"},"\n",{"#f":5}],"c-1":["^ ",{"->":"rock"},"\n",{"#f":5}],"c-2":["^ ",{"->":"wheelbarrow"},"\n",{"#f":5}],"c-3":["^ ",{"->":"tarp"},"\n",{"#f":5}]}],{"#f":1}],"playhouse":[["^You run into the playhouse, closing the door behind you. There is a small table, and you crawl underneath it, hoping that it will block you out of the view if someone looks through the window. You sit under the table, an excited smile on your face. You’re pretty sure you have found the best spot to hide in.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"playhouse1"},"\n",{"#f":5}]}],{"#f":1}],"playhouse1":[["^Minutes pass. You eventually hear footsteps outside the playhouse, approaching it carefully. They come closer and closer, stopping by the window. You can only assume that someone is peering in, trying to see if anyone is hiding inside. You don’t dare to move a muscle.","\n","^The footsteps start again, but this time they’re moving away from the playhouse. You relax, and the smile on your face just spreads wider. You were right, this is a good place to hide.","\n","^More time goes by. Every now and then you can hear someone running or walking nearby, but you remain hidden. It’s honestly starting to get a little bit boring at this point, but you want to win, and so, you stay put","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"playhouse2"},"\n",{"#f":5}]}],{"#f":1}],"playhouse2":[["^A new set of footsteps appears, but this time they’re determinedly approaching the playhouse. You freeze, not sure if you want to be found at this point or not. But before you have time to decide, the door of the playhouse flies open, revealing Jamie in the doorway, immediately locking eyes with you. A grin slowly appears on their face.","\n","^“I told you she would be here!” they call out to someone behind them as you start crawling from underneath the table.","\n","^“Wait, really?” the initial seeker says, visibly confused. “I swear I checked the playhouse, first thing!”","\n","^“I was hiding under the table!” you exclaim, proudly revealing your hiding spot. The seeker groans a bit in frustration.","\n","^“Should have checked looked from the doorway,” he mumbles. “But fine! You win this round!”","\n","^You briefly celebrate your victory, but you know that the game isn’t over yet - it’s now your turn to seek.","\n",["ev",{"^->":"playhouse2.0.12.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":".^.^.c-0","flg":2},{"s":["^The game continues ",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"playhouse2.0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":".^.^.12.s"},[{"#n":"$r2"}],{"->":"gamecontinue"},"\n",{"#f":5}]}],{"#f":1}],"rock":[["^You run behind the rock and crouch behind it. It’s not the most secure spot in the backyard, but it should work well enough. After all, it’s a classic spot for a reason.","\n","^Time passes, but soon enough you hear someone approaching you. You remain still for a while, hoping that the seeker would just pass your hiding place, but you can soon hear him coming from the left side of the rock.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"rock2"},"\n",{"#f":5}]}],{"#f":1}],"rock2":[["^You start moving quietly to the right while still crouched, trying to avoid the seeker. You do manage to prolong your hiding time for a few extra seconds, but the footsteps behind you catch up to you soon enough.","\n","^“A-ha!” the seeker exclaims once he catches a glimpse of you. “Found you, Emily!”","\n","^You let out a sigh and stand straight again. Maybe if you would have bolted it you might have had a chance to stay in the game.","\n","^“I wasn’t the first, right?” you ask hesitantly, and the seeker shakes his head.","\n","^“I found a few before you,” he says. “But there’s still a bunch left, so c’mon, let’s go find them.”","\n","^You nod your head, and then join the seekers, slowly but steadily hunting down the rest of the hiders.","\n","ev","str","^The game continues.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"gamecontinue"},"\n",{"#f":5}]}],{"#f":1}],"wheelbarrow":[["^You spot an empty wheelbarrow standing in the middle of the yard. It’s just there, and you decide to climb into it, trying to curl into the smallest ball possible. And then, you wait.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"wheelbarrow2"},"\n",{"#f":5}]}],{"#f":1}],"wheelbarrow2":[["^It doesn’t take that long until you can already hear footsteps approaching the yard, but then they suddenly stop, not too far away. Your heart is pounding as you hope that the seeker would just go away.","\n","^“Emily,” the seeker says, sounding somewhat confused. “I can literally see you all the way from here.”","\n","^You slowly raise your head and look towards the seeker, feeling a bit embarrassed. You have no idea what you were thinking. Of course you’d be easily spotted from the wheelbarrow.","\n","^“I… I uhm…” you try to come up with something to defend yourself with, but the words refuse to come out. And so you just climb out of the wheelbarrow, and start looking for other players, knowing for a fact that you were the first one to be found.","\n","ev","str","^The game continues.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"gamecontinue"},"\n",{"#f":5}]}],{"#f":1}],"tarp":[["^After a moment’s consideration you run to the tarp on the ground. You lift it up, peeking inside to check that there is nothing gross underneath it, but apart from a few dozen bugs, it seems to be fine. You hesitate for a little bit longer, but decide to crawl under the tarp anyway, curling up into a small ball, trying your best to pretend to be nothing but a pile of dirt under the thing.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"tarp2"},"\n",{"#f":5}]}],{"#f":1}],"tarp2":[["^Time passes slowly. It’s getting increasingly hotter underneath the tarp, direct sunlight mercilessly shining straight to it. But you are resilient, and stay unmoving.","\n","^Finally, you hear tentative footsteps walking around the yard - the seeker is here. You remain completely still and wait. The footsteps stop for a moment, but they soon keep walking, right past the tarp, further and further away. Your hiding place is officially a successful one.","\n","^It doesn’t feel like one for long, though. It’s getting warmer and warmer each passing second, beads of sweat rolling down your face without you even moving. The air under the tarp is stuffy and unsatisfying. You’re hardly even focusing on the fact that people are constantly passing through the yard, looking for the hiders.","\n","^Breathe in, breathe out. Breathe in, breathe out.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"tarp3"},"\n",{"#f":5}]}],{"#f":1}],"tarp3":[["^Eventually you can’t take it anymore, and even though you can still hear someone walking around in the yard, you crawl from underneath the tarp, covered in sweat. The warm summer air suddenly feels like a cool winter breeze on your skin.","\n","^“I give up!” you declare the second you’re back on your feet. “I don’t wanna hide anymore!”","\n","^The seeker looks at you, a little surprised and confused, but doesn’t say anything, and so, you join the others.","\n","ev","str","^The game continues.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"gamecontinue"},"\n",{"#f":5}]}],{"#f":1}],"gamecontinue":[["^You and all the other kids play a few more rounds of hide-and-seek. Jamie absolutely dominates the game, finding incredible hiding spots that are always among the last ones to be found. You don’t remember the last time you’ve had this much fun playing with the others.","\n","^Eventually the kids start getting called back inside for dinners, and soon your dad calls you and Jamie inside too. You have lasagna. Life is good.","\n","^After eating, you go to the living room, plopping yourself down on the floor in front of the tv. Your dog, Teddy, lazily lifts his head to look at you, but soon lays back down on the ground, continuing his nap.","\n","ev","str","^You watch tv.","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"watchtv"},"\n",{"#f":5}]}],{"#f":1}],"watchtv":[["^This is one of your favorite cartoons, one of your favorite episodes, even. It’s just about to get to the best part when the channel suddenly changes.","\n","^“Hey!” you exclaim, and turn around to see your sibling sitting on the couch with a wide grin on their face, the remote of the tv in their hand.","\n","^\"Mom says it's my turn now,\" Jamie says, settling better on the couch. \"Besides, you have seen this episode like, a million times. Do you really want to see another rerun?\"","\n","ev","str","^Protest","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask to join","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"protest"},"\n",{"#f":5}],"c-1":["^ ",{"->":"join"},"\n",{"#f":5}]}],{"#f":1}],"protest":[["^“But it’s my favorite!” you insist. “I wanna watch it! Besides, you’re only watching this because John likes it, and you have a crush on him!”","\n","^You masterfully avoid the pillow that is thrown your way. The expression on Jamie’s face has turned into a deep frown.","\n","^“I do not!” they claim, but you know better based on what was written in their diary. “Just… shut up or I’ll go tell mom that… that you were sneaking treats to your room again!”","\n","^Your heart drops in fear at the threat, and you don’t have any other choice but to admit your defeat. You poke your tongue out at Jamie as a final sign of defiance before getting up from the floor and heading upstairs to your room.","\n","ev","str","^You spend some time alone","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"prologue_cont"},"\n",{"#f":5}]}],{"#f":1}],"join":[["^You glance back towards the tv. The show that’s on the screen right now actually looks… sort of interesting.","\n","^“Can I… watch with you?” you ask tentatively. You look back at your sibling, who looks surprised by the question, but soon starts smiling at you.","\n","^“Sure,” Jamie says, moving a bit on the couch to make more space for you, and you hop on it. They start explaining to you what the show is about, something about human looking aliens traveling through time and space, but honestly it goes badly over your head.","\n","^But the show is still good. Maybe you should watch it with Jamie more often.","\n","ev","str","^You enjoy the show","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"prologue_cont"},"\n",{"#f":5}]}],{"#f":1}],"prologue_cont":[["^You enter your bedroom and crawl to bed, still clutching the flashlight in your hands. As you lay on your back, you keep watching the long shadows on the ceiling. Usually they look like long legs of a monster to you, but tonight, they are just shadows. They’re nothing to worry about.","\n","^You fall into peaceful sleep, looking forward to the best summer vacation ever.","\n","^The days fly by. Every day of the summer is filled with fun and excitement, and it feels like it will never end. You wish it would never end.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"prol_cont2"},"\n",{"#f":5}]}],{"#f":1}],"prol_cont2":["^The kids from the neighborhood are all gathered again to play hide-and-seek. It’s almost a weekly tradition at this point, just a massive game that everyone participates in. It’s something you look forward to every week, although Jamie remains the reigning champion.","\n","^The final round of the day starts. You are the seeker this time, dutifully counting all the way to 50 so that the kids have time to run around and hide.","\n","^“47… 48… 49… 50!” you yell out. “Ready or not, here I come!”","\n","^You start looking for the kids, finding them one by one, collecting your army of seekers. Unsurprisingly, one kid seems to be harder to find again - Jamie. After checking every yard, every possible hiding spot, they’re still nowhere to be found. ",{"->":"But_your_sibling_has_to_be_somewhere_right"},"\n",{"#f":1}],"But_your_sibling_has_to_be_somewhere_right":[["^But your sibling has to be somewhere, right?","\n","ev","str","^Search the playhouse","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Search the toolshed","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Search the compost","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^You keep looking","/str",{"VAR?":"option1_chosen"},{"VAR?":"option2_chosen"},"&&",{"VAR?":"option3_chosen"},"&&","/ev",{"*":".^.c-3","flg":21},{"c-0":["^ ",{"->":"playhouselook"},"\n",{"#f":5}],"c-1":["^ ",{"->":"toolshed"},"\n",{"#f":5}],"c-2":["^ ",{"->":"compost"},"\n",{"#f":5}],"c-3":["^ ",{"->":"keeplooking"},"\n",{"#f":5}]}],{"#f":1}],"playhouselook":["ev",{"CNT?":"playhouse"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Ever since you hid within the playhouse, it has become one of the first places anyone checks as a seeker, you included. Because of that, you’re pretty sure that someone has already checked the spot already, but perhaps Jamie simply moved there at some point without anyone noticing? It’s worth a look.","\n","^You open the door of the playhouse, expecting to see your sibling under the table, grinning triumphantly because they managed to hide for so long. But no such luck. The playhouse is empty and lifeless. You close the door, disappointed.","\n",{"->":".^.^.^.4"},null]}],"nop","\n","ev",{"CNT?":"playhouse"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Your eyes land on the playhouse in your neighbor’s yard. You’re pretty sure that someone must have checked it already, but perhaps Jamie simply moved there at some point? It’s worth a look.","\n","^You open the door of the playhouse, expecting to see your sibling under the table, grinning triumphantly because they managed to hide for so long. But no such luck. The playhouse is empty and lifeless. You close the door, disappointed.","\n",{"->":".^.^.^.11"},null]}],"nop","\n","ev",true,"/ev",{"VAR=":"option1_chosen","re":true},{"->":"But_your_sibling_has_to_be_somewhere_right"},{"#f":1}],"toolshed":["^There is a tool shed behind your house where all the shovels, branch cutters, and other gardening tools are stored when they’re not in use. It used to be a very popular hiding spot, until your parents deemed it too dangerous for kids to hide amidst sharp tools, and put a padlock on the door. It’s a long shot, but maybe Jamie got it open somehow and snuck in?","\n","^You run up to the tool shed and try to open the door. But as usual, it’s locked, the padlock holding on sturdily. Could it be that Jamie got in, but someone put the lock back on, locking them inside? The thought terrifies you.","\n","^“Jamie, are you in there? Say something if you are!” you shout through the door, both dreading and hoping for a response from within. No sound comes out. It appears there is no one within the shed.","\n","ev",true,"/ev",{"VAR=":"option2_chosen","re":true},{"->":"But_your_sibling_has_to_be_somewhere_right"},{"#f":1}],"compost":["^As unlikely as it might be… perhaps Jamie is hiding within the compost? You can’t imagine that even they would be so dedicated to a game of hide-and-seek, but they’ve surprised you before.","\n","^You go up to the compost and slowly open the lid. The disgusting stench of rotting food and leaves hit you immediately, making you want to gag. There’s no way Jamie could be there. But you have to make sure.","\n","^You hold your breath as you peer into the depths of the compost, seeing flies, ants, beetles, and spiders crawling amidst the mass, but not your sibling. You slam the lid shut, gasping for fresh air, already feeling lightheaded. You’re glad Jamie wasn’t in there, but their absence is growing more worrisome by the minute.","\n","ev",true,"/ev",{"VAR=":"option3_chosen","re":true},{"->":"But_your_sibling_has_to_be_somewhere_right"},{"#f":1}],"keeplooking":[["^You desperately restart the whole search, going through every nook and cranny once again. The other kids are searching, too, the older kids even daring to climb up some ladders to check the rooftops of the houses. Still, Jamie is nowhere to be found.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search2"},"\n",{"#f":5}]}],{"#f":1}],"search2":[["^The shadows are slowly growing longer, and the searching turns almost frantic. Kids start checking the insides of the houses, too. When you go inside your home, your mother notices the urgent look on your face, and makes you admit in a shaky voice that no one can find your sibling.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search3"},"\n",{"#f":5}]}],{"#f":1}],"search3":[["^Adults join the search, too. But still, no Jamie.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search4"},"\n",{"#f":5}]}],{"#f":1}],"search4":[["^The police show up. Your mother is hysterical at this point. You barely manage to talk to the police through your sobs.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search5"},"\n",{"#f":5}]}],{"#f":1}],"search5":[["^Jamie doesn't come home that night.","\n","^Or the next one.","\n","^Or the next one.","\n","^You fall asleep holding the flashlight, every night.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"3_days"},"\n",{"#f":5}]}],{"#f":1}],"3_days":[["^Jamie has been missing for 3 days.","\n","ev","str","^You hear your dad calling for you","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"12_days"},"\n",{"#f":5}]}],{"#f":1}],"12_days":[["^Jamie has been missing for 12 days.","\n","^You can hear your parents arguing downstairs. You can’t really make out what they’re saying, but the topic of the argument isn’t hard to guess: Jamie. Your mom is blaming your dad for not keeping a closer eye on your sibling, while your dad is yelling at her to stop wallowing in self-pity and help with the search.","\n","^You squeeze your flashlight tighter as their voices grow louder until you hear the front door slam. One of them has left the house. You reach to pet Teddy who’s laying in bed with you, your only support in the middle of this all.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"30_days"},"\n",{"#f":5}]}],{"#f":1}],"30_days":[["^Jamie has been missing for 30 days.","\n","^It’s hard to believe that it has been a full month already. The absence of your sibling feels like a constant ache in your chest, and your parents aren’t doing any better. No one has cleaned since Jamie went missing, and the house is starting to look like it, too.","\n","^Every single night you dream about Jamie. They are always somewhere just out of your reach, getting further and further away. You try to run after them, to beg them to come back, but you trip and fall flat on your face. When you look down, you can see your legs tangled in spider webs, the thick woven masses holding you in place as Jamie disappears from sight, swallowed by a black wall of tiny, writhing legs. You yell as the wall comes closer, claiming you as well, as thousands of spiders flood your body, covering your eyes, crawling in your nose, filling your mouth with a bitter taste.","\n","ev","str","^End of prologue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"chap1"},"\n",{"#f":5}]}],{"#f":1}],"chap1":[["^CHAPTER 1","\n","^Jamie has been missing for 1 852 days.","\n","^Life is… different now. It has been for years, and at this point you have just gotten used to it. You try to make most of it, though, no matter what.","\n","^You return home from school. The only one greeting you is Teddy, running to you the second he hears the door open.","\n","ev","str","^Pet the dog","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ignore the dog","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"dogpet"},"\n",{"#f":5}],"c-1":["^ ",{"->":"dogignore"},"\n",{"#f":5}]}],{"#f":1}],"dogpet":[["ev",true,"/ev",{"VAR=":"dogpetyes","re":true},"^“Hey there,” you mumble as you lean down to scratch the dog behind his ear, trying to listen closely to hear if there’s anyone else in the house, but you’re met with silence. Your mother must be passed out somewhere again. Your father seems to not be home, as usual.","\n","^“Have you been fed today?” you continue talking to the dog, and head to the kitchen only to see an empty food bowl on the kitchen counter - right where you left it this morning. “I guess not.”","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogpet2"},"\n",{"#f":5}]}],{"#f":1}],"dogpet2":[["^Teddy follows your every move. He’s probably used to having a late lunch by now, since finding the bowl on the counter is more common than the alternative. You feel bad for the poor thing, but there’s not much you can do about it. Your mother is incapable of taking care of even herself, it’s no wonder Teddy gets neglected as well.","\n","^You put the filled-up food and water bowl onto the ground, and Teddy immediately dives in. You watch him for a while, sigh, and head towards your room since your homework won’t do it itself.","\n","ev","str","^You head upstairs","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dad"},"\n",{"#f":5}]}],{"#f":1}],"dogignore":[["^“Hi,” you mumble absentmindedly, and push past Teddy despite his enthusiastic greeting.","\n","^“Hi!” you call out louder, trying to see if there is a response from another human being, but there is only silence. Your mother must be passed out somewhere again, and your father seems to not be home, as usual.","\n","^You sigh and roll your eyes before swinging your backpack over your shoulder again. You need to head upstairs to your room, there’s plenty of homework for you to do for tomorrow.","\n","ev","str","^Time for homework","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dad"},"\n",{"#f":5}]}],{"#f":1}],"dad":[["^Jamie has been missing for 1 856 days.","\n","^Your dad is home, for once. You’re sitting on the couch with him, watching baseball together. You don’t really care for the sport, but this is one of the very few ways you actually get to spend time with him, so you pretend to like it. It’s not too bad, though. At this point you’re actually looking forward to the games, often already waiting for your dad on the couch before he’s even home from work.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dad2"},"\n",{"#f":5}]}],{"#f":1}],"dad2":[["^The team your dad likes is losing tonight. It’s unfortunate, but he seems to be in good spirits regardless.","\n","^“They still have a chance to make it to the finals,” your dad explains to you, voice full of hope. “They just need to win the next game, and then two other teams need to lose… I’m telling you, Ember, it’s possible.”","\n","^You just nod, not really knowing how to answer. But as you watch the team fumble with the ball yet again, you don’t feel quite as hopeful as your dad.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dad3"},"\n",{"#f":5}]}],{"#f":1}],"dad3":[["^The nice atmosphere is shattered as you both can hear a car driving to the house. Your dad shifts on the couch immediately, sitting more straight. You notice him glancing towards the door every now and then, but you keep your eyes on the tv.","\n","^The front door opens, and the clinking bags tell you your mom has come back from the store.","\n","^“Hi, honey,” your dad calls out with a tense voice, but gets no answer. The clinking of the bags disappears to the kitchen, and your dad’s eyes linger on the doorway. You know your time with your dad is coming to an end.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dad4"},"\n",{"#f":5}]}],{"#f":1}],"dad4":[["^“Ember…” your dad starts, eyes still on the kitchen where you can hear your mother unloading bottles after bottles. “Could you… could you go to your room for a second? I need to talk to your mom.”","\n","^You try not to look disappointed, but it still stings a bit that you didn’t even get to finish the game this time.","\n","^“Okay,” you say quietly, and slide off the couch. You glance at your dad, but he’s already getting up himself, and heads to the kitchen.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dad5"},"\n",{"#f":5}]}],{"#f":1}],"dad5":[["^You manage to get upstairs before the fight in the kitchen properly starts, and close the door to your room behind you. It muffles the worst of it, at least.","\n","^You flop onto your bed, and out of habit reach for the flashlight on your night stand. But the second your fingers wrap around it, you jolt back and look at the flashlight with wide eyes. It’s covered in tiny spiders, making the surface of the flashlight seem alive.","\n","^You just stare at the sight in front of you for a while. You have no idea how this many spiders could have made it to your room. Maybe you should call out for your dad to come and see. Or maybe, since he’s in the middle of an argument with your mom, you should just… kill the spiders. Or leave them alone.","\n","ev","str","^Call for your dad","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Kill the spiders","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Leave the spiders be","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["^ ",{"->":"dadhelp"},"\n",{"#f":5}],"c-1":["^ ",{"->":"killspiders"},"\n",{"#f":5}],"c-2":["^ ",{"->":"ignorespiders"},"\n",{"#f":5}]}],{"#f":1}],"dadhelp":[["ev",true,"/ev",{"VAR=":"dadhelpyes","re":true},"^You take a deep breath. Calling your dad to help is probably the best idea. Maybe there is a bigger issue with the spiders, like a whole nest somewhere that needs to be taken care of.","\n","^“Dad?” you call out, but you can still hear the distant arguing continue downstairs. “Dad!” you yell louder, and this time you’re pretty sure the arguing stops for a little while. “DAD!” you yell one more time, and soon, you can hear footsteps coming up the stairs. You keep your eyes locked on the spiders, making sure they don’t escape.","\n","^“Emily?” your dad says as he opens the door to your room, voice still strained from the arguing, although he does his best to cover it up. You’re pretty sure you can still hear your mother raving on and on about something, but you can’t make out the words. “What is it?”","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dadhelp2"},"\n",{"#f":5}]}],{"#f":1}],"dadhelp2":[["^You say nothing, and just point at the flashlight. From the corner of your eye you can see your dad approach the nightstand.","\n","^“Oh no…” he mumbles, taking in the sight of the spiders. “That’s a lot of spiders…”","\n","^“I don’t know where they came from,” you tell your father, still eyeing the spiders. “I came here and they were just… there. I haven’t even taken the flashlight outside or anything for a while, I swear.”","\n","^“I don’t think it’s anything you did…” your dad reassures gently, peeking behind the nightstand. “Have you seen a lot of spiders in your room recently?”","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dadhelp3"},"\n",{"#f":5}]}],{"#f":1}],"dadhelp3":[["^You think for a moment.","\n","^“Kinda,” you say. “Like… I think I saw three spiders last week.”","\n","^“Were they here by the nightstand?”","\n","^You shake your head.","\n","^“They’ve been all over.”","\n","^Your dad straightens up and looks around the room, clearly deep in thought.","\n","^“Maybe we need to do a deep cleaning in your room,” he says, more to himself than you. “Try to see if there are some corners with a bunch of spiderwebs, and get rid of them.” He looks at the flashlight again. “Want me to clean this up for you?”","\n","^“Yeah…” you say quietly. You need to flashlight back in a top notch condition.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dadhelp4"},"\n",{"#f":5}]}],{"#f":1}],"dadhelp4":[["^Your dad simply nods, and gently picks up the flashlight, with spiders and all, and carries it out of your room, dangling it with just two fingers. But you trust your dad. He will bring the flashlight back.","\n","^You grab a book and settle down on your bed, and soon enough your dad returns to your room, handing you the flashlight.","\n","^“There,” he says, “took it apart when I cleaned it and everything. I can promise you, there will be no more spiders on it.”","\n","^You thank him, and look over the flashlight, just in case. It really seems that your dad did a good job with it, and you feel grateful for that.","\n","^Your dad smiles at you, and sits next to you on the bed for a little while.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dadhelp5"},"\n",{"#f":5}]}],{"#f":1}],"dadhelp5":[["^“I know that flashlight means a lot to you,” he says gently, placing his hand on your shoulder. “We, uh… We all miss Jamie. And I’m glad you still like to keep them close.”","\n","^You look down at the flashlight in your hands. Your dad is right, you keep the flashlight with you at all times. It’s the last thing Jamie gave you before they disappeared, and it has helped you through a lot.","\n","^You can’t look at your dad right now, a sudden storm of emotions inside of you stirring up and forming a lump in your throat. You just nod, eyes still on the flashlight, but your dad seems to pick up on what’s on your mind. He squeezes your shoulder reassuringly, and starts getting off the bed again.","\n","^“Let me, uh… Let me know if more spiders appear like that, okay?” he says, sounding a bit choked up himself. You nod again, and your father then exits your bedroom, leaving you alone, deep in thought.","\n","ev","str","^You do something","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie"},"\n",{"#f":5}]}],{"#f":1}],"killspiders":[["^You jump off of your bed, determined. You need to get rid of the spiders, as soon as possible. Sure, they are harmless, but they are honestly freaking you out quite a bit.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"killspiders2"},"\n",{"#f":5}]}],{"#f":1}],"killspiders2":[["^You dash out of your room to the bathroom next door, ignoring the loud fighting downstairs, and grab a full roll of toilet paper with you before returning to your room, slamming the door shut behind you. The voices from downstairs don’t pause even for a second.","\n","^You stand next to the nightstand, tear away a few pieces of toilet paper, and then, with a deep breath, start catching the spiders off of the flashlight with the paper, one by one, and squeezing them to death between your fingers. Each tiny body crunching beneath your grip makes your skin crawl.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"killspiders3"},"\n",{"#f":5}]}],{"#f":1}],"killspiders3":[["^The pile of used toilet paper next to you keeps growing, but eventually you catch the final spider, kill it, and add it to the graveyard of your own making. Carefully, you pick up the flashlight and wipe away the spider webs covering its surface. When you’re done, you check it once more, just to be sure - no spiders or webs remain.","\n","^“Good as new,” you mumble to yourself, and place the flashlight back on the nightstand.","\n","ev","str","^You do something","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie"},"\n",{"#f":5}]}],{"#f":1}],"ignorespiders":[["^You just stare at the spiders for a little while longer, feeling conflicted. On one hand, you want to get rid of the spiders, but then again… They are just there, existing. And you’d feel bad for them if you killed them or something.","\n","^You lay down on your bed somewhat reluctantly. You’ll let the spiders be, for now. You’ll just check the flashlight later and wipe it when there’s, hopefully, no more spiders left. It’s fine, they’re only spiders. They’ll do no harm.","\n","ev","str","^You do something","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie"},"\n",{"#f":5}]}],{"#f":1}],"dogdie":[["^You sit with Teddy for a long while. But eventually, the grumbling of your stomach reminds you of the fact that it’s been hours since the last time you ate anything. You get up from the couch and stretch. Teddy looks at you curiously.","\n","^“Dinnertime for me,” you mumble to the dog, and start heading towards the kitchen. Teddy follows you, but instead of walking towards the kitchen, he heads to the front entrance.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie2"},"\n",{"#f":5}]}],{"#f":1}],"dogdie2":[["^“Teddy, you wanna go outside?” you ask him and change your course to the front door. Teddy is a well behaved dog, a little bit old at this point, and you often let him go outside to the yard on his own where he’ll do his business before returning inside on his own. He’s a good boy like that.","\n","^You open the front door for Teddy, and he slips through it to go outside. You leave the door slightly ajar, and head to the kitchen to make yourself a sandwich. While there, you glance at the clock on the wall. It’s around 7PM. Your mom should be back soon. Not that it really matters, anyway. She will most likely just go and pass out on the couch as soon as she’s home. But you like to keep tabs on her.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie3"},"\n",{"#f":5}]}],{"#f":1}],"dogdie3":[["^You take out the bread and the ingredients, and start putting together your sandwich. With every car that approaches your house you listen closely, trying to hear if it’s your mom, but so far all of the cars have just passed your home.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie4"},"\n",{"#f":5}]}],{"#f":1}],"dogdie4":[["^As you’re placing a slice of cheese on top of some ham, you hear another car, and subconsciously tense. It’s your mother, you just know it. You glance towards the kitchen entrance, jaw clenched. From the corner of your eye, you can see a spider running across the door frame.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie5"},"\n",{"#f":5}]}],{"#f":1}],"dogdie5":[["^Tires screech outside. Then you can hear a thud, followed by the unmistakable sound of Teddy whimpering.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie6"},"\n",{"#f":5}]}],{"#f":1}],"dogdie6":[["^Your heart jumps to your throat, and you immediately rush outside. At the very beginning of the driveway you can see your mother’s car. The front of it has something that looks awfully lot like blood on it. Your mom is just stepping out of the car herself, cursing loudly.","\n","^“Mom,” you start, voice shaky, “what ha-”","\n","^But then your eyes land on the whimpering pile of fur just a few feet in front of the car.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie7"},"\n",{"#f":5}]}],{"#f":1}],"dogdie7":[["^“No,” you mutter as you rush to your dog. “No no no no no.”","\n","^You kneel beside Teddy, though the mangled heap of fur and blood barely resembles him anymore. His front legs are twisted and broken, bent at impossible angles that jut outward in unnatural directions. Deep gashes expose torn muscles and raw tissue, blood pouring from the wounds and soaking his once-light fur in a dark red.","\n","^Teddy’s head appears crushed, slightly sunken on one side, and one of his eyes has been forced from its socket. It hangs loosely by the optical nerve, resting on the concrete beside him, as if staring back at the house.","\n","^The sight makes you feel sick.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogdie8"},"\n",{"#f":5}]}],{"#f":1}],"dogdie8":[["^“M-mom, we need to take him to the vet, right now, we-” you start with a shaky voice, but soon find your mother standing next to you, reeking of booze.","\n","^“Stupid dog,” she slurs while looking at the mess in front of you both. “Came out of nowhere!”","\n","^You turn your teary eyes up to your mother who is just sneering at your dog with zero urgency, heart aching with disbelief because of her attitude.","\n","ev","str","^Yell at your mom","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Comfort the dog","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"momyell"},"\n",{"#f":5}],"c-1":["^ ",{"->":"dogcomfort"},"\n",{"#f":5}]}],{"#f":1}],"momyell":[["ev",true,"/ev",{"VAR=":"momyellyes","re":true},"^“What’s wrong with you!” you yell at your mother, tears running down your face. “You hit Teddy! We need to help him!”","\n","^You try to get up from the ground to go and grab a blanket from inside that you could wrap Teddy in, but your mother pushes you back on your knees on the ground.","\n","^“Deserved that,” she mumbles. “Wouldn’t move away.”","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"momyell2"},"\n",{"#f":5}]}],{"#f":1}],"momyell2":[["^You look at your mom, refusing to believe what you’re hearing.","\n","^“He’s going to die!” you insist desperately, but all your mother does is sneer.","\n","^“Never liked that mutt,” she mumbles.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"momyell3"},"\n",{"#f":5}]}],{"#f":1}],"momyell3":[["^You open your mouth to yell again, but a miserable whimper from Teddy draws your attention back to the dog. You crawl closer to him, trying your best to focus on just his one working eye and nothing else. You place a shaky hand on the fur, gently stroking it, doing your best to comfort the dog.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"momyell4"},"\n",{"#f":5}]}],{"#f":1}],"momyell4":[["^The realization that there is nothing you can do hits you hard. The nearest vet is a 30-minute drive away, and Teddy needs help now—not whenever you could get there on foot, especially since you’re pretty sure none of your estranged neighbors would agree to drive you and your bleeding dog","\n","^The best you can do now is to be there for Teddy during his final moments.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"momyell5"},"\n",{"#f":5}]}],{"#f":1}],"momyell5":[["^“It’s okay, boy,” you whisper, trying to swallow your tears. “It… it’ll be over soon.”","\n","^You keep stroking the fur, feeling the labored breaths of the dog beneath your hand. He’s looking at you and whimpering, but you can do nothing but pet him and whisper words of comfort and affection while your mother keeps spewing insults at the dog.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"momyell6"},"\n",{"#f":5}]}],{"#f":1}],"momyell6":[["^And then there is the final pained whimper from the dog before he stops moving.","\n","ev","str","^You mourn the loss of your best friend","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mourn"},"\n",{"#f":5}]}],{"#f":1}],"dogcomfort":[["^You push aside your anger towards your mother for now, and crawl closer to Teddy. You know his injuries are severe, and that there isn’t much that you are able to do at this point. But at the very least you can try and comfort him during his final moments.","\n","^“It’s okay, boy,” you whisper, trying to swallow your tears. “It… it’ll be over soon.”","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogcomfort2"},"\n",{"#f":5}]}],{"#f":1}],"dogcomfort2":[["^You place your shaky hand on the dog, petting his fur. You can feel how much effort each breath is taking at this point, and you wish for Teddy’s sake that it will all end soon.","\n","^“You were such a good boy,” you keep whispering. “I will miss you so, so much.”","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"dogcomfort3"},"\n",{"#f":5}]}],{"#f":1}],"dogcomfort3":[["^Eventually, the labored breaths cease.","\n","ev","str","^You mourn the loss of your best friend","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mourn"},"\n",{"#f":5}]}],{"#f":1}],"mourn":[["^You sit on the driveway by what used to be your beloved dog long after your mother has gone inside, sobbing.","\n","^Eventually you go inside as well, but only to retrieve the old, worn-out blanket Teddy used to sleep on. You wrap his body in it, head to the backyard, and start digging.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mourn2"},"\n",{"#f":5}]}],{"#f":1}],"mourn2":[["^It takes a long time before you even have a decent enough hole to put Teddy in. Your arms are hurting, but you don’t care. He deserves the effort. You gently lay the body, still wrapped within the blanket, to the hole, and start moving dirt back into the hole. Another hour passes, mainly because the overwhelming need to cry overtakes you every now and then.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mourn3"},"\n",{"#f":5}]}],{"#f":1}],"mourn3":[["^It’s dark by the time you make it inside the house, beelining straight to your room. You don’t even care to check on your mother. Right now it doesn’t matter if she is passed out somewhere or not - she killed Teddy. You don’t have an ounce of sympathy towards her.","\n","^You fall onto your bed and start sobbing once again, allowing yourself to fully break down now that Teddy doesn't need you anymore. You don’t know how much time passes.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mourn4"},"\n",{"#f":5}]}],{"#f":1}],"mourn4":[["^At some point you hear the front door open and close downstairs, followed by a short silence.","\n","^“Teddy?” you hear the voice of your dad call out, sounding confused. He’s probably expecting the dog to come greet him at the door, like he usually does. The mental image of that makes you cry harder.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"mourn5"},"\n",{"#f":5}]}],{"#f":1}],"mourn5":[["^Your dad soon appears through your open door, since he probably heard your cries all the way downstairs.","\n","^“Ember?” he says with a clearly concerned voice. “Emily, what happened?”","\n","^You can’t answer. As soon as your dad sits on the bed beside you, you get up and cling to him tightly. He seems a bit surprised, noticing the dirt and dried blood on your hands, but soon wraps his arms around you, likely piecing together what happened from your state and Teddy's absence.","\n","^At least you don’t have to mourn alone anymore.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"evening"},"\n",{"#f":5}]}],{"#f":1}],"evening":[["^Jamie has been missing for 1 879 days.","\n","^It has been a week since the accident, but with your mother’s attitude you refuse to call it such. Her words from that day are still fresh in your mind, and they hurt just as much as they did then. Despite being drunk, she should have had no problems spotting the dog coming near the car. She just… hadn’t cared.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"evening2"},"\n",{"#f":5}]}],{"#f":1}],"evening2":[["^An intrusive image of Teddy dying on the ground appears in your head, and you slam your mathbook shut, giving up on trying to do your homework for the day. It’s getting late, and you have made zero progress within the last hour. Your head is too full, you’re too distracted. A single tear falls down your cheek, but you quickly wipe it away.","\n","^You get up from your desk, stretching your limbs a bit. You’re not exactly feeling sleepy yet, but the general exhaustion you’re feeling tells you that it might be the time for you to head to bed. Maybe you should go brush your teeth first, though, but you’re not sure if you have the energy for that anymore.","\n","ev","str","^Go to bed","/str",{"VAR?":"momyellyes"},"!","/ev",{"*":".^.c-0","flg":5},"ev","str","^Go to bed","/str",{"VAR?":"momyellyes"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Go to brush your teeth","/str",{"VAR?":"dadhelpyes"},"!","/ev",{"*":".^.c-2","flg":5},"ev","str","^Go to brush your teeth","/str",{"VAR?":"dadhelpyes"},"/ev",{"*":".^.c-3","flg":5},{"c-0":["^ ",{"->":"bedroom_noyell"},"\n",{"#f":5}],"c-1":["^ ",{"->":"bedroom"},"\n",{"#f":5}],"c-2":["^ ",{"->":"bathroom_nohelp"},"\n",{"#f":5}],"c-3":["^ ",{"->":"bathroom"},"\n",{"#f":5}]}],{"#f":1}],"bedroom":[["ev",true,"/ev",{"VAR=":"mombedroomtalk","re":true},"^/ Player spawns in the bedroom for the talk with mom that changes the variable. Leads to spider-dog /","\n","ev","str","^You crash through the front door","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"outside"},"\n",{"#f":5}]}],{"#f":1}],"bedroom_noyell":[["ev",true,"/ev",{"VAR=":"mombedroomtalk","re":true},"^/ Player spaws in the bedroom for the talk with the mom that didn't change the variable. Leads to spider-dog /","\n","ev","str","^You crash through the front door","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"outside"},"\n",{"#f":5}]}],{"#f":1}],"bathroom_nohelp":[["^/ Player spawns in the bathroom for the talk with dad no help that eventually leads to spider-dog /","\n","ev","str","^You crash through the front door","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"outside"},"\n",{"#f":5}]}],{"#f":1}],"bathroom":[["^/ Player spawns in the bathroom for the talk with dad that eventually leads to spider-dog /","\n","ev","str","^You crash through the front door","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"outside"},"\n",{"#f":5}]}],{"#f":1}],"outside":[["^You crash through the front door of your house, desperate to escape the monstrosity behind you. You need space, distance - anything to put between you and this thing.","\n","^It follows right behind you though. You don’t know what to do. The flashlight isn’t working on this thing, if anything, it’s only making things worse for you, forcing you to have a proper look at the decaying head of what used to be Teddy.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"outside2"},"\n",{"#f":5}]}],{"#f":1}],"outside2":[["^You run towards your backyard, where you know you have more options. For a moment, you gain distance between you and the spider-dog-creature, as it skids on the pavement, unable to turn as fast. You glance at Teddy’s grave, that now looks like something has dug its way up from there.","\n","^You need to do something before it reaches you. You need to do something now. You could hide. You could fight. Or maybe…","\n","ev","str","^Hide","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Fight","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Talk","/str",{"VAR?":"momyellyes"},{"VAR?":"dogpetyes"},"&&",{"VAR?":"mombedroomtalk"},"&&","/ev",{"*":".^.c-2","flg":5},"ev","str","^???","/str",{"VAR?":"momyellyes"},{"VAR?":"dogpetyes"},"&&",{"VAR?":"mombedroomtalk"},"&&","!","/ev",{"*":".^.c-3","flg":5},{"c-0":["^ ",{"->":"spiderhide"},"\n",{"#f":5}],"c-1":["^ ",{"->":"spiderfight"},"\n",{"#f":5}],"c-2":["^ ",{"->":"talking"},"\n",{"#f":5}],"c-3":["^ ",{"->":"nothing"},"\n",{"#f":5}]}],{"#f":1}],"spiderhide":[["^Without even thinking properly, you hide behind the tool shed. You press your back against the hard surface of the wall, trying your best to keep your labored breaths as quiet as possible. You can soon hear the pitter patter of the spider legs moving around, clearly looking for you.","\n","^You remain completely still, heart pounding in your ears. This is just like playing hide-and-seek, you tell yourself, only the stakes are much, much higher this time.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"spiderhide2"},"\n",{"#f":5}]}],{"#f":1}],"spiderhide2":[["^You listen as the spider-dog walks around, every single muscle in your body tense and ready to run again in case the thing gets too close to you. You wait for a moment.","\n","^Then another.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"spiderhide3"},"\n",{"#f":5}]}],{"#f":1}],"spiderhide3":[["^And then listen as the sounds of the creature slowly but steadily disappear.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"spiderhide4"},"\n",{"#f":5}]}],{"#f":1}],"spiderhide4":[["^You allow yourself to freely breathe again. The creature has left. You carefully peek from your hiding spot and confirm that yard is in fact safe again. That thing is still somewhere out there, though, but for now, you’re just glad it’s gone.","\n","^You’re trembling as you head back towards inside, constantly looking over your shoulder to make sure that the creature isn’t coming back for you. But you don’t see it again, and you wholeheartedly hope that it will stay that way for the rest of your life.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"ch1_end"},"\n",{"#f":5}]}],{"#f":1}],"spiderfight":[["^You spot the shovel you used just a week ago, still leaning against the tool shed wall. You run to it, grab it, and as you turn, you see the creature closing in on you. Without thinking you raise the shovel, squeeze your eyes shut, and plunge the shovel down with all your force just as the creature reaches you.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"spiderfight2"},"\n",{"#f":5}]}],{"#f":1}],"spiderfight2":[["^There is a loud crunching sound followed by a flop, and everything around you goes quiet.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"spiderfight3"},"\n",{"#f":5}]}],{"#f":1}],"spiderfight3":[["^You open your eyes slowly, glancing down at your feet. The spider-dog lies motionless on the ground, except for the twitching spider legs. Thick, black liquid oozes from its neck where you decapitated it. You stare at what you've done, into the lifeless eyes of what used to be Teddy. You feel like throwing up.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"spiderfight4"},"\n",{"#f":5}]}],{"#f":1}],"spiderfight4":[["^You slowly look towards the pile of dirt that is where you buried Teddy originally, and then back to the corpse at your feet. You have no idea how you could explain this to anyone. Better to just bury the thing again and hope that it won’t come back to haunt you in the future.","\n","^The night is silent as you work. Thankfully, there’s already a hole in the ground, so all you have to do is drag the surprisingly light corpse to the grave and cover it. When you're done, you stand motionless by the freshly covered grave for a moment, the weight of what you've done settling in. Then, quietly, you return inside, shaken to your core.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"ch1_end"},"\n",{"#f":5}]}],{"#f":1}],"talking":[["^You slow to a stop, a sudden thought plaguing your mind. You have no idea where it came from. You have no idea why on Earth you think this could even remotely work, but you decide to do it anyway.","\n","^You will talk to the creature.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"talking2"},"\n",{"#f":5}]}],{"#f":1}],"talking2":[["^You turn around to face the thing, only to realize that it has stopped as well and is now just looking at you, observing. You ignore the spider legs growing out of the remains of your dog, and just focus on what is still Teddy's familiar face. You swallow, and kneel down.","\n","^“Hey boy,” you say quietly, addressing the dog. “C’mere.”","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"talking3"},"\n",{"#f":5}]}],{"#f":1}],"talking3":[["^The spider-dog hesitates for a moment, but then approaches you, the legs of the dog dingling in the air. You raise your shaky hand, and carefully pet the dog’s head. It seems to like it.","\n","^You swallow again, harder this time as you can feel a lump slowly forming in your throat.","\n","^“I’ve missed you,” you whisper. “Dad has been missing you, too.”","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"talking4"},"\n",{"#f":5}]}],{"#f":1}],"talking4":[["^You scratch Teddy behind his ear, right where he used to like it. The creature leans into your touch. The familiarity of the situation is bringing tears to your eyes.","\n","^“I’m sorry mom did this to you,” you continue. “She didn’t want this to happen, either. At least I think so. You were such a good boy, she… she couldn’t have hated you, no matter what she said.” You continue scratching, blinking rapidly. “You were the best boy. You were there for me when literally no one else was. When… when Jamie disappeared, when dad started to be away more, when mom…”","\n","^Your words trail off. You have no idea why you are even saying at this point, the words just falling out of your mouth on their own.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"talking5"},"\n",{"#f":5}]}],{"#f":1}],"talking5":[["^“Thank you. For everything,” you whisper. “You can rest now.”","\n","^You continue petting and scratching Teddy. He looks at you, and for a while that is all you can see. Your best friend, looking back at you like nothing would have ever gone wrong. He moves closer and licks your face, licks the tears that spilled out without you even realizing. It makes you chuckle just a bit, although the laughter feels hollow.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"talking6"},"\n",{"#f":5}]}],{"#f":1}],"talking6":[["^Your hands aren’t holding onto Teddy anymore. The feeling confuses you, and you look at the dog closely. Before your eyes, he slowly disintegrates into countless tiny spiders, that then scatter away from you until you are sitting alone on the ground.","\n","^Somehow, your heart doesn’t feel quite as heavy anymore.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"ch1_end"},"\n",{"#f":5}]}],{"#f":1}],"nothing":[["^There's nothing else you can think of right now. You need to decide what to do, fast.","\n","ev","str","^Hide","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Fight","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"spiderhide"},"\n",{"#f":5}],"c-1":["^ ",{"->":"spiderfight"},"\n",{"#f":5}]}],{"#f":1}],"ch1_end":["^Jamie has been missing for 1 880 days.","\n","^The next day you pretend that nothing has happened. Your parents are none the wiser. How they managed to miss the horrors of last night remains a mystery to you, but somehow they did. In a way, you feel grateful for that. You prefer to pretend like yesterday didn’t happen, anyway.","\n","^And life continues on. But you can’t help but feel even more cautious of every shadow. Because now you know that monsters are real after all.","\n","end",{"#f":1}],"global decl":["ev",false,{"VAR=":"option1_chosen"},false,{"VAR=":"option2_chosen"},false,{"VAR=":"option3_chosen"},false,{"VAR=":"dogpetyes"},false,{"VAR=":"dadhelpyes"},false,{"VAR=":"momyellyes"},false,{"VAR=":"mombedroomtalk"},"/ev","end",null],"#f":1}],"listDefs":{}}