{"inkVersion":21,"root":[["^It’s the first day of summer holiday. It doesn’t mean much to you yet since you’re only starting pre-school next year, but you do know that summer holiday means that all the kids from the neighborhood will be able to play all day, every day. It’s hard to not be excited about that.","\n","^It’s not even 10AM when the doorbell already rings. The other kids, just as excited about all the possibilities as you are, are coming to ask you to play. You and your older sibling, Jamie, head out together, and only 15 minutes later there are around 10 kids passionately arguing about what to do.","\n","ev","str","^Continue","/str","/ev",{"*":"0.c-0","flg":4},{"c-0":["^ ",{"->":"prol1"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"prol1":[["^Eventually everyone settles for hide-and-seek. You are among the first ones to hide, running straight to the backyard of one of the other kids, looking for the best place to hide.","\n","^You see a small playhouse you could hide in, a large rock to crouch behind, a wheelbarrow, and a tarp on the ground you could crawl under.","\n","ev","str","^Hide in the playhouse","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Hide behind the rock","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Hide in the wheelbarrow","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Hide under the tarp","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["^ ",{"->":"playhouse"},"\n",{"#f":5}],"c-1":["^ ",{"->":"rock"},"\n",{"#f":5}],"c-2":["^ ",{"->":"wheelbarrow"},"\n",{"#f":5}],"c-3":["^ ",{"->":"tarp"},"\n",{"#f":5}]}],{"#f":1}],"playhouse":[["^You run into the playhouse, closing the door behind you. There is a small table, and you crawl underneath it, hoping that it will block you out of the view if someone looks through the window. You sit under the table, an excited smile on your face. You’re pretty sure you have found the best spot to hide in.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"playhouse1"},"\n",{"#f":5}]}],{"#f":1}],"playhouse1":[["^Minutes pass. You eventually hear footsteps outside the playhouse, approaching it carefully. They come closer and closer, stopping by the window. You can only assume that someone is peering in, trying to see if anyone is hiding inside. You don’t dare to move a muscle.","\n","^The footsteps start again, but this time they’re moving away from the playhouse. You relax, and the smile on your face just spreads wider. You were right, this is a good place to hide.","\n","^More time goes by. Every now and then you can hear someone running or walking nearby, but you remain hidden. It’s honestly starting to get a little bit boring at this point, but you want to win, and so, you stay put","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"playhouse2"},"\n",{"#f":5}]}],{"#f":1}],"playhouse2":[["^A new set of footsteps appears, but this time they’re determinedly approaching the playhouse. You freeze, not sure if you want to be found at this point or not. But before you have time to decide, the door of the playhouse flies open, revealing Jamie in the doorway, immediately locking eyes with you. A grin slowly appears on their face.","\n","^“I told you she would be here!” they call out to someone behind them as you start crawling from underneath the table.","\n","^“Wait, really?” the initial seeker says, visibly confused. “I swear I checked the playhouse, first thing!”","\n","^“I was hiding under the table!” you exclaim, proudly revealing your hiding spot. The seeker groans a bit in frustration.","\n","^“Should have checked looked from the doorway,” he mumbles. “But fine! You win this round!”","\n","^You briefly celebrate your victory, but you know that the game isn’t over yet - it’s now your turn to seek.","\n","ev","str","^The game continues","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"gamecontinue"},"\n",{"#f":5}]}],{"#f":1}],"rock":[["^You run behind the rock and crouch behind it. It’s not the most secure spot in the backyard, but it should work well enough. After all, it’s a classic spot for a reason.","\n","^Time passes, but soon enough you hear someone approaching you. You remain still for a while, hoping that the seeker would just pass your hiding place, but you can soon hear him coming from the left side of the rock.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"rock2"},"\n",{"#f":5}]}],{"#f":1}],"rock2":[["^You start moving quietly to the right while still crouched, trying to avoid the seeker. You do manage to prolong your hiding time for a few extra seconds, but the footsteps behind you catch up to you soon enough.","\n","^“A-ha!” the seeker exclaims once he catches a glimpse of you. “Found you, Emily!”","\n","^You let out a sigh and stand straight again. Maybe if you would have bolted it you might have had a chance to stay in the game.","\n","^“I wasn’t the first, right?” you ask hesitantly, and the seeker shakes his head.","\n","^“I found a few before you,” he says. “But there’s still a bunch left, so c’mon, let’s go find them.”","\n","^You nod your head, and then join the seekers, slowly but steadily hunting down the rest of the hiders.","\n","ev","str","^The game continues","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"gamecontinue"},"\n",{"#f":5}]}],{"#f":1}],"wheelbarrow":[["^You spot an empty wheelbarrow standing in the middle of the yard. It’s just there, and you decide to climb into it, trying to curl into the smallest ball possible. And then, you wait.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"wheelbarrow2"},"\n",{"#f":5}]}],{"#f":1}],"wheelbarrow2":[["^It doesn’t take that long until you can already hear footsteps approaching the yard, but then they suddenly stop, not too far away. Your heart is pounding as you hope that the seeker would just go away.","\n","^“Emily,” the seeker says, sounding somewhat confused. “I can literally see you all the way from here.”","\n","^You slowly raise your head and look towards the seeker, feeling a bit embarrassed. You have no idea what you were thinking. Of course you’d be easily spotted from the wheelbarrow.","\n","^“I… I uhm…” you try to come up with something to defend yourself with, but the words refuse to come out. And so you just climb out of the wheelbarrow, and start looking for other players, knowing for a fact that you were the first one to be found.","\n","ev","str","^The game continues","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"gamecontinue"},"\n",{"#f":5}]}],{"#f":1}],"tarp":[["^After a moment’s consideration you run to the tarp on the ground. You lift it up, peeking inside to check that there is nothing gross underneath it, but apart from a few dozen bugs, it seems to be fine. You hesitate for a little bit longer, but decide to crawl under the tarp anyway, curling up into a small ball, trying your best to pretend to be nothing but a pile of dirt under the thing.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"tarp2"},"\n",{"#f":5}]}],{"#f":1}],"tarp2":[["^Time passes slowly. It’s getting increasingly hotter underneath the tarp, direct sunlight mercilessly shining straight to it. But you are resilient, and stay unmoving.","\n","^Finally, you hear tentative footsteps walking around the yard - the seeker is here. You remain completely still and wait. The footsteps stop for a moment, but they soon keep walking, right past the tarp, further and further away. Your hiding place is officially a successful one.","\n","^It doesn’t feel like one for long, though. It’s getting warmer and warmer each passing second, beads of sweat rolling down your face without you even moving. The air under the tarp is stuffy and unsatisfying. You’re hardly even focusing on the fact that people are constantly passing through the yard, looking for the hiders.","\n","^Breathe in, breathe out. Breathe in, breathe out.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"tarp3"},"\n",{"#f":5}]}],{"#f":1}],"tarp3":[["^Eventually you can’t take it anymore, and even though you can still hear someone walking around in the yard, you crawl from underneath the tarp, covered in sweat. The warm summer air suddenly feels like a cool winter breeze on your skin.","\n","^“I give up!” you declare the second you’re back on your feet. “I don’t wanna hide anymore!”","\n","^The seeker looks at you, a little surprised and confused, but doesn’t say anything, and so, you join the others.","\n","ev","str","^The game continues","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"gamecontinue"},"\n",{"#f":5}]}],{"#f":1}],"gamecontinue":[["^You and all the other kids play a few more rounds of hide-and-seek. Jamie absolutely dominates the game, finding incredible hiding spots that are always among the last ones to be found. You don’t remember the last time you’ve had this much fun playing with the others.","\n","^Eventually the kids start getting called back inside for dinners, and soon your dad calls you and Jamie inside too. You have lasagna. Life is good.","\n","^After eating, you go to the living room, plopping yourself down on the floor in front of the tv. Your dog, Teddy, lazily lifts his head to look at you, but soon lays back down on the ground, continuing his nap.","\n","ev","str","^You watch tv","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"watchtv"},"\n",{"#f":5}]}],{"#f":1}],"watchtv":[["^This is one of your favorite cartoons, one of your favorite episodes, even. It’s just about to get to the best part when the channel suddenly changes.","\n","^“Hey!” you exclaim, and turn around to see your sibling sitting on the couch with a wide grin on their face, the remote of the tv in their hand.","\n","^\"Mom says it's my turn now,\" Jamie says, settling better on the couch. \"Besides, you have seen this episode like, a million times. Do you really want to see another rerun?\"","\n","ev","str","^Protest","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Ask to join","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["^ ",{"->":"protest"},"\n",{"#f":5}],"c-1":["^ ",{"->":"join"},"\n",{"#f":5}]}],{"#f":1}],"protest":[["^“But it’s my favorite!” you insist. “I wanna watch it! Besides, you’re only watching this because John likes it, and you have a crush on him!”","\n","^You masterfully avoid the pillow that is thrown your way. The expression on Jamie’s face has turned into a deep frown.","\n","^“I do not!” they claim, but you know better based on what was written in their diary. “Just… shut up or I’ll go tell mom that… that you were sneaking treats to your room again!”","\n","^Your heart drops in fear at the threat, and you don’t have any other choice but to admit your defeat. You poke your tongue out at Jamie as a final sign of defiance before getting up from the floor and heading upstairs to your room.","\n","ev","str","^Go to bed","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"prologue_cont"},"\n",{"#f":5}]}],{"#f":1}],"join":[["^You glance back towards the tv. The show that’s on the screen right now actually looks… sort of interesting.","\n","^“Can I… watch with you?” you ask tentatively. You look back at your sibling, who looks surprised by the question, but soon starts smiling at you.","\n","^“Sure,” Jamie says, moving a bit on the couch to make more space for you, and you hop on it. They start explaining to you what the show is about, something about human looking aliens traveling through time and space, but honestly it goes badly over your head.","\n","^But the show is still good. Maybe you should watch it with Jamie more often.","\n","ev","str","^Enjoy the show","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"prologue_cont"},"\n",{"#f":5}]}],{"#f":1}],"prologue_cont":[["^You enter your bedroom and crawl to bed, still clutching the flashlight in your hands. As you lay on your back, you keep watching the long shadows on the ceiling. Usually they look like long legs of a monster to you, but tonight, they are just shadows. They’re nothing to worry about.","\n","^You fall into peaceful sleep, looking forward to the best summer vacation ever.","\n","^The days fly by. Every day of the summer is filled with fun and excitement, and it feels like it will never end. You wish it would never end.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"prol_cont2"},"\n",{"#f":5}]}],{"#f":1}],"prol_cont2":["^The kids from the neighborhood are all gathered again to play hide-and-seek. It’s almost a weekly tradition at this point, just a massive game that everyone participates in. It’s something you look forward to every week, although Jamie remains the reigning champion.","\n","^The final round of the day starts. You are the seeker this time, dutifully counting all the way to 50 so that the kids have time to run around and hide.","\n","^“47… 48… 49… 50!” you yell out. “Ready or not, here I come!”","\n","^You start looking for the kids, finding them one by one, collecting your army of seekers. Unsurprisingly, one kid seems to be harder to find again - Jamie. After checking every yard, every possible hiding spot, they’re still nowhere to be found. ",{"->":"But_your_sibling_has_to_be_somewhere_right"},"\n",{"#f":1}],"But_your_sibling_has_to_be_somewhere_right":[["^But your sibling has to be somewhere, right?","\n","ev","str","^Search the playhouse","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Search the toolshed","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Search the compost","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^You keep looking","/str",{"VAR?":"option1_chosen"},{"VAR?":"option2_chosen"},"&&",{"VAR?":"option3_chosen"},"&&","/ev",{"*":".^.c-3","flg":21},{"c-0":["^ ",{"->":"playhouselook"},"\n",{"#f":5}],"c-1":["^ ",{"->":"toolshed"},"\n",{"#f":5}],"c-2":["^ ",{"->":"compost"},"\n",{"#f":5}],"c-3":["^ ",{"->":"keeplooking"},"\n",{"#f":5}]}],{"#f":1}],"playhouselook":["ev",{"CNT?":"playhouse"},"/ev",[{"->":".^.b","c":true},{"b":["\n","^Ever since you hid within the playhouse, it has become one of the first places anyone checks as a seeker, you included. Because of that, you’re pretty sure that someone has already checked the spot already, but perhaps Jamie simply moved there at some point without anyone noticing? It’s worth a look.","\n","^You open the door of the playhouse, expecting to see your sibling under the table, grinning triumphantly because they managed to hide for so long. But no such luck. The playhouse is empty and lifeless. You close the door, disappointed.","\n",{"->":".^.^.^.4"},null]}],"nop","\n","ev",{"CNT?":"playhouse"},"!","/ev",[{"->":".^.b","c":true},{"b":["\n","^Your eyes land on the playhouse in your neighbor’s yard. You’re pretty sure that someone must have checked it already, but perhaps Jamie simply moved there at some point? It’s worth a look.","\n","^You open the door of the playhouse, expecting to see your sibling under the table, grinning triumphantly because they managed to hide for so long. But no such luck. The playhouse is empty and lifeless. You close the door, disappointed.","\n",{"->":".^.^.^.11"},null]}],"nop","\n","ev",true,"/ev",{"VAR=":"option1_chosen","re":true},{"->":"But_your_sibling_has_to_be_somewhere_right"},{"#f":1}],"toolshed":["^There is a tool shed behind your house where all the shovels, branch cutters, and other gardening tools are stored when they’re not in use. It used to be a very popular hiding spot, until your parents deemed it too dangerous for kids to hide amidst sharp tools, and put a padlock on the door. It’s a long shot, but maybe Jamie got it open somehow and snuck in?","\n","^You run up to the tool shed and try to open the door. But as usual, it’s locked, the padlock holding on sturdily. Could it be that Jamie got in, but someone put the lock back on, locking them inside? The thought terrifies you.","\n","^“Jamie, are you in there? Say something if you are!” you shout through the door, both dreading and hoping for a response from within. No sound comes out. It appears there is no one within the shed.","\n","ev",true,"/ev",{"VAR=":"option2_chosen","re":true},{"->":"But_your_sibling_has_to_be_somewhere_right"},{"#f":1}],"compost":["^As unlikely as it might be… perhaps Jamie is hiding within the compost? You can’t imagine that even they would be so dedicated to a game of hide-and-seek, but they’ve surprised you before.","\n","^You go up to the compost and slowly open the lid. The disgusting stench of rotting food and leaves hit you immediately, making you want to gag. There’s no way Jamie could be there. But you have to make sure.","\n","^You hold your breath as you peer into the depths of the compost, seeing flies, ants, beetles, and spiders crawling amidst the mass, but not your sibling. You slam the lid shut, gasping for fresh air, already feeling lightheaded. You’re glad Jamie wasn’t in there, but their absence is growing more worrisome by the minute.","\n","ev",true,"/ev",{"VAR=":"option3_chosen","re":true},{"->":"But_your_sibling_has_to_be_somewhere_right"},{"#f":1}],"keeplooking":[["^You desperately restart the whole search, going through every nook and cranny once again. The other kids are searching, too, the older kids even daring to climb up some ladders to check the rooftops of the houses. Still, Jamie is nowhere to be found.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search2"},"\n",{"#f":5}]}],{"#f":1}],"search2":[["^The shadows are slowly growing longer, and the searching turns almost frantic. Kids start checking the insides of the houses, too. When you go inside your home, your mother notices the urgent look on your face, and makes you admit in a shaky voice that no one can find your sibling.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search3"},"\n",{"#f":5}]}],{"#f":1}],"search3":[["^Adults join the search, too. But still, no Jamie.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search4"},"\n",{"#f":5}]}],{"#f":1}],"search4":[["^The police show up. Your mother is hysterical at this point. You barely manage to talk to the police through your sobs.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"search5"},"\n",{"#f":5}]}],{"#f":1}],"search5":[["^Jamie doesn't come home that night.","\n","^Or the next one.","\n","^Or the next one.","\n","^You fall asleep holding the flashlight, every night.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"3_days"},"\n",{"#f":5}]}],{"#f":1}],"3_days":[["^Jamie has been missing for 3 days.","\n","ev","str","^What happened?","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"12_days"},"\n",{"#f":5}]}],{"#f":1}],"12_days":[["^Jamie has been missing for 12 days.","\n","^You can hear your parents arguing downstairs. You can’t really make out what they’re saying, but the topic of the argument isn’t hard to guess: Jamie. Your mom is blaming your dad for not keeping a closer eye on your sibling, while your dad is yelling at her to stop wallowing in self-pity and help with the search.","\n","^You squeeze your flashlight tighter as their voices grow louder until you hear the front door slam. One of them has left the house. You reach to pet Teddy who’s laying in bed with you, your only support in the middle of this all.","\n","ev","str","^Continue","/str","/ev",{"*":".^.c-0","flg":4},{"c-0":["^ ",{"->":"30_days"},"\n",{"#f":5}]}],{"#f":1}],"30_days":["^Jamie has been missing for 30 days.","\n","^It’s hard to believe that it has been a full month already. The absence of your sibling feels like a constant ache in your chest, and your parents aren’t doing any better. No one has cleaned since Jamie went missing, and the house is starting to look like it, too.","\n","^Every single night you dream about Jamie. They are always somewhere just out of your reach, getting further and further away. You try to run after them, to beg them to come back, but you trip and fall flat on your face. When you look down, you can see your legs tangled in spider webs, the thick woven masses holding you in place as Jamie disappears from sight, swallowed by a black wall of tiny, writhing legs. You yell as the wall comes closer, claiming you as well, as thousands of spiders flood your body, covering your eyes, crawling in your nose, filling your mouth with a bitter taste.","\n","end",{"#f":1}],"global decl":["ev",false,{"VAR=":"option1_chosen"},false,{"VAR=":"option2_chosen"},false,{"VAR=":"option3_chosen"},"/ev","end",null],"#f":1}],"listDefs":{}}